system/NACA0021_1.6e5
// From CACTUS
// Re = 1.6e5
// (alpha_deg cl cd)
(-180.0 0.0 0.025)
(-175.0 0.66 0.055)
(-170.0 0.85 0.14)
(-165.0 0.68 0.23)
(-160.0 0.635 0.32)
(-155.0 0.67 0.42)
(-150.0 0.77 0.575)
(-145.0 0.9 0.755)
(-140.0 0.98 0.925)
(-135.0 0.93 1.085)
(-130.0 0.85 1.225)
(-125.0 0.76 1.35)
(-120.0 0.67 1.465)
(-115.0 0.575 1.555)
(-110.0 0.45 1.635)
(-105.0 0.32 1.7)
(-100.0 0.185 1.75)
(-95.0 0.05 1.78)
(-90.0 -0.09 1.8)
(-85.0 -0.23 1.8)
(-80.0 -0.365 1.78)
(-75.0 -0.5 1.735)
(-70.0 -0.63 1.665)
(-65.0 -0.76 1.575)
(-60.0 -0.875 1.47)
(-55.0 -0.955 1.345)
(-50.0 -1.02 1.215)
(-45.0 -1.05 1.075)
(-40.0 -1.035 0.92)
(-35.0 -0.98 0.745)
(-30.0 -0.855 0.57)
(-25.0 -0.6664 0.405)
(-22.0 -0.6023 0.329)
(-20.0 -0.592 0.282)
(-18.0 -0.6098 0.238)
(-16.0 -0.6487 0.196)
(-14.0 -0.6993 0.158)
(-13.0 -0.7255 0.086)
(-12.0 -0.7363 0.0292)
(-11.0 -0.7443 0.0266)
(-10.0 -0.7374 0.0243)
(-9.0 -0.7148 0.0222)
(-8.0 -0.6745 0.0204)
(-7.0 -0.6209 0.0187)
(-6.0 -0.5486 0.0174)
(-5.0 -0.4687 0.0163)
(-4.0 -0.38 0.0155)
(-3.0 -0.2861 0.0148)
(-2.0 -0.1879 0.0143)
(-1.0 -0.0842 0.014)
(0.0 0.0 0.0139)
(1.0 0.0842 0.014)
(2.0 0.1879 0.0143)
(3.0 0.2861 0.0148)
(4.0 0.38 0.0155)
(5.0 0.4687 0.0163)
(6.0 0.5486 0.0174)
(7.0 0.6209 0.0187)
(8.0 0.6745 0.0204)
(9.0 0.7148 0.0222)
(10.0 0.7374 0.0243)
(11.0 0.7443 0.0266)
(12.0 0.7363 0.0292)
(13.0 0.7255 0.086)
(14.0 0.6993 0.158)
(16.0 0.6487 0.196)
(18.0 0.6098 0.238)
(20.0 0.592 0.282)
(22.0 0.6023 0.329)
(25.0 0.6664 0.405)
(30.0 0.855 0.57)
(35.0 0.98 0.745)
(40.0 1.035 0.92)
(45.0 1.05 1.075)
(50.0 1.02 1.215)
(55.0 0.955 1.345)
(60.0 0.875 1.47)
(65.0 0.76 1.575)
(70.0 0.63 1.665)
(75.0 0.5 1.735)
(80.0 0.365 1.78)
(85.0 0.23 1.8)
(90.0 0.09 1.8)
(95.0 -0.05 1.78)
(100.0 -0.185 1.75)
(105.0 -0.32 1.7)
(110.0 -0.45 1.635)
(115.0 -0.575 1.555)
(120.0 -0.67 1.465)
(125.0 -0.76 1.35)
(130.0 -0.85 1.225)
(135.0 -0.93 1.085)
(140.0 -0.98 0.925)
(145.0 -0.9 0.755)
(150.0 -0.77 0.575)
(155.0 -0.67 0.42)
(160.0 -0.635 0.32)
(165.0 -0.68 0.23)
(170.0 -0.85 0.14)
(175.0 -0.66 0.055)
(180.0 0.0 0.025)
